* TODO Better support for infix types
* TODO Add type display to Alg, Rec, Tuple output
* TODO Make lazy interface (IDs and such)
* TODO Write test suite
* TODO Newtypes, records
* TODO Lists
* TODO Type-aliases
* TODO Cleanup
* TODO Refactor the first-pass/second-pass gubbins
* TODO Consider defaulting common classes like Num, IsString, etc.
* TODO Consider supporting ambiguous vars
E.g. `Proxy :: Proxy a` or `Left 'a' :: Either Char a`. In other
words, if it's unambiguous (none of the data slots depend on a type
variable), might as well print it. GHCi supports this by defaulting,
we can support it by just ignoring unused type variables.
* DONE Remove state-monad depdency
  CLOSED: [2016-03-07 Mon 10:53]
  - State "DONE"       from "TODO"       [2016-03-07 Mon 10:53]
* DONE Investigate a :present cmd in GHCi
  CLOSED: [2016-02-27 Sat 21:07]
  - Note taken on [2016-02-27 Sat 21:07] \\
    Works!
  - State "DONE"       from "TODO"       [2016-02-27 Sat 21:07]
I think it would be a perfect solution to whether to produce e.g. a
plain-text or terminal presentation.
* DONE Support extension via classes
  CLOSED: [2016-02-24 Wed 23:15]
  - State "DONE"       from "TODO"       [2016-02-24 Wed 23:15]
* DONE Need to add type-signatures to retain let generalization
  CLOSED: [2016-02-24 Wed 22:35]
  - State "DONE"       from "TODO"       [2016-02-24 Wed 22:35]
* DONE Primitive types (Char, Int, etc.)
  CLOSED: [2016-03-01 Tue 15:23]
  - State "DONE"       from "TODO"       [2016-03-01 Tue 15:23]
  CLOCK: [2016-03-01 Tue 15:07]--[2016-03-01 Tue 15:23] =>  0:16
* DONE Support including type in the presentation
  CLOSED: [2016-03-08 Tue 17:19]
  - State "DONE"       from "TODO"       [2016-03-08 Tue 17:19]
  CLOCK: [2016-03-08 Tue 15:54]--[2016-03-08 Tue 16:28] =>  0:34
* DONE Tuples
  CLOSED: [2016-03-08 Tue 17:40]
  - State "DONE"       from "TODO"       [2016-03-08 Tue 17:40]
  CLOCK: [2016-03-01 Tue 15:23]--[2016-03-01 Tue 16:02] =>  0:39
